
## Plan Result (ecs_practice/terraform)

[CI link](https://github.com/harayu-k/infra_sandbox/actions/runs/12973214293)


### :warning: Resource Deletion will happen
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 16 to add, 0 to change, 4 to destroy.</code></pre>

* Create
  * aws_cloudwatch_log_group.ecs_frontend
  * aws_ecs_cluster.backend
  * aws_ecs_task_definition.frontend
  * aws_iam_policy.frontend_ecs_task_execution
  * aws_iam_policy_attachment.frontend_ecs_task_execution
  * aws_iam_role.frontend_ecs_task_execution
  * aws_lb.ingress
  * aws_vpc_endpoint.interface[&#34;ecr_api&#34;]
  * aws_vpc_endpoint.interface[&#34;ecr_dkr&#34;]
  * aws_vpc_endpoint.interface_logs
  * aws_vpc_endpoint.s3_gateway
  * aws_vpc_security_group_ingress_rule.frontend
  * aws_vpc_security_group_ingress_rule.ingress
* Delete
  * aws_ecs_cluster.main
* Replace
  * aws_ecs_service.backend
  * aws_iam_policy.backend_ecs_task_execution
  * aws_iam_policy_attachment.backend_ecs_task_execution


<details><summary>Change Result (Click me)</summary>

```hcl

  # data.aws_iam_policy_document.frontend_ecs_task_execution will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "frontend_ecs_task_execution" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "ecr:GetAuthorizationToken",
            ]
          + effect    = "Allow"
          + resources = [
              + "*",
            ]
        }
      + statement {
          + actions   = [
              + "ecr:BatchCheckLayerAvailability",
              + "ecr:BatchGetImage",
              + "ecr:GetDownloadUrlForLayer",
            ]
          + effect    = "Allow"
          + resources = [
              + "arn:aws:ecr:ap-northeast-1:992382441056:repository/frontend",
            ]
        }
      + statement {
          + actions   = [
              + "logs:CreateLogStream",
              + "logs:PutLogEvents",
            ]
          + effect    = "Allow"
          + resources = [
              + (known after apply),
            ]
        }
    }

  # aws_cloudwatch_log_group.ecs_frontend will be created
  + resource "aws_cloudwatch_log_group" "ecs_frontend" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + log_group_class   = (known after apply)
      + name              = "/ecs/frontend"
      + name_prefix       = (known after apply)
      + retention_in_days = 3
      + skip_destroy      = false
      + tags_all          = {
          + "Managed" = "Terraform"
        }
    }

  # aws_ecs_cluster.backend will be created
  + resource "aws_ecs_cluster" "backend" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + name     = "backend"
      + tags_all = {
          + "Managed" = "Terraform"
        }

      + setting (known after apply)
    }

  # aws_ecs_cluster.main will be destroyed
  # (because aws_ecs_cluster.main is not in configuration)
  - resource "aws_ecs_cluster" "main" {
      - arn      = "arn:aws:ecs:ap-northeast-1:992382441056:cluster/main" -> null
      - id       = "arn:aws:ecs:ap-northeast-1:992382441056:cluster/main" -> null
      - name     = "main" -> null
      - tags     = {} -> null
      - tags_all = {
          - "Managed" = "Terraform"
        } -> null

      - setting {
          - name  = "containerInsights" -> null
          - value = "disabled" -> null
        }
    }

  # aws_ecs_service.backend must be replaced
-/+ resource "aws_ecs_service" "backend" {
      ~ cluster                            = "arn:aws:ecs:ap-northeast-1:992382441056:cluster/main" -> (known after apply) # forces replacement
      - health_check_grace_period_seconds  = 0 -> null
      ~ iam_role                           = "/aws-service-role/ecs.amazonaws.com/AWSServiceRoleForECS" -> (known after apply)
      ~ id                                 = "arn:aws:ecs:ap-northeast-1:992382441056:service/main/backend" -> (known after apply)
        name                               = "backend"
      ~ platform_version                   = "1.4.0" -> (known after apply)
      - propagate_tags                     = "NONE" -> null
      - tags                               = {} -> null
      ~ triggers                           = {} -> (known after apply)
        # (11 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # aws_ecs_task_definition.frontend will be created
  + resource "aws_ecs_task_definition" "frontend" {
      + arn                      = (known after apply)
      + arn_without_revision     = (known after apply)
      + container_definitions    = jsonencode(
            [
              + {
                  + cpu               = 256
                  + essential         = true
                  + image             = "992382441056.dkr.ecr.ap-northeast-1.amazonaws.com/frontend:initial"
                  + logConfiguration  = {
                      + logDriver = "awslogs"
                      + options   = {
                          + awslogs-group         = "/ecs/frontend"
                          + awslogs-region        = "ap-northeast-1"
                          + awslogs-stream-prefix = "ecs"
                        }
                    }
                  + memory            = 1024
                  + memoryReservation = 512
                  + name              = "frontend"
                  + portMappings      = [
                      + {
                          + appProtocol   = "http"
                          + containerPort = 80
                          + hostPort      = 80
                          + protocol      = "tcp"
                        },
                    ]
                },
            ]
        )
      + cpu                      = "512"
      + execution_role_arn       = (known after apply)
      + family                   = "frontend"
      + id                       = (known after apply)
      + memory                   = "1024"
      + network_mode             = "awsvpc"
      + requires_compatibilities = [
          + "FARGATE",
        ]
      + revision                 = (known after apply)
      + skip_destroy             = false
      + tags_all                 = {
          + "Managed" = "Terraform"
        }
      + track_latest             = false

      + runtime_platform {
          + cpu_architecture        = "ARM64"
          + operating_system_family = "LINUX"
        }
    }

  # aws_iam_policy.backend_ecs_task_execution must be replaced
-/+ resource "aws_iam_policy" "backend_ecs_task_execution" {
      ~ arn              = "arn:aws:iam::992382441056:policy/AWSECSTaskExeccutionRole" -> (known after apply)
      ~ attachment_count = 1 -> (known after apply)
      ~ id               = "arn:aws:iam::992382441056:policy/AWSECSTaskExeccutionRole" -> (known after apply)
      ~ name             = "AWSECSTaskExeccutionRole" -> "backend-AWSECSTaskExeccutionRole" # forces replacement
      + name_prefix      = (known after apply)
      ~ policy_id        = "ANPA6ODU2KZQGB2JYWVQF" -> (known after apply)
      - tags             = {} -> null
        # (4 unchanged attributes hidden)
    }

  # aws_iam_policy.frontend_ecs_task_execution will be created
  + resource "aws_iam_policy" "frontend_ecs_task_execution" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + id               = (known after apply)
      + name             = "frontend-AWSECSTaskExeccutionRole"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = (known after apply)
      + policy_id        = (known after apply)
      + tags_all         = {
          + "Managed" = "Terraform"
        }
    }

  # aws_iam_policy_attachment.backend_ecs_task_execution must be replaced
-/+ resource "aws_iam_policy_attachment" "backend_ecs_task_execution" {
      - groups     = [] -> null
      ~ id         = "backend-ECSTaskExecution" -> (known after apply)
        name       = "backend-ECSTaskExecution"
      ~ policy_arn = "arn:aws:iam::992382441056:policy/AWSECSTaskExeccutionRole" -> (known after apply) # forces replacement
      - users      = [] -> null
        # (1 unchanged attribute hidden)
    }

  # aws_iam_policy_attachment.frontend_ecs_task_execution will be created
  + resource "aws_iam_policy_attachment" "frontend_ecs_task_execution" {
      + id         = (known after apply)
      + name       = "frontend-ECSTaskExecution"
      + policy_arn = (known after apply)
      + roles      = [
          + "frontend-ECSTaskExecution",
        ]
    }

  # aws_iam_role.frontend_ecs_task_execution will be created
  + resource "aws_iam_role" "frontend_ecs_task_execution" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ecs-tasks.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "frontend-ECSTaskExecution"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = {
          + "Managed" = "Terraform"
        }
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # aws_lb.ingress will be created
  + resource "aws_lb" "ingress" {
      + arn                                                          = (known after apply)
      + arn_suffix                                                   = (known after apply)
      + client_keep_alive                                            = 3600
      + desync_mitigation_mode                                       = "defensive"
      + dns_name                                                     = (known after apply)
      + drop_invalid_header_fields                                   = false
      + enable_deletion_protection                                   = false
      + enable_http2                                                 = true
      + enable_tls_version_and_cipher_suite_headers                  = false
      + enable_waf_fail_open                                         = false
      + enable_xff_client_port                                       = false
      + enforce_security_group_inbound_rules_on_private_link_traffic = (known after apply)
      + id                                                           = (known after apply)
      + idle_timeout                                                 = 60
      + internal                                                     = false
      + ip_address_type                                              = "ipv4"
      + load_balancer_type                                           = "application"
      + name                                                         = "ingress"
      + name_prefix                                                  = (known after apply)
      + preserve_host_header                                         = false
      + security_groups                                              = [
          + "sg-0e4473224aa390b41",
        ]
      + subnets                                                      = [
          + "subnet-050ef07f50fd10881",
          + "subnet-0f175c9251edd634b",
        ]
      + tags_all                                                     = {
          + "Managed" = "Terraform"
        }
      + vpc_id                                                       = (known after apply)
      + xff_header_processing_mode                                   = "append"
      + zone_id                                                      = (known after apply)

      + subnet_mapping (known after apply)
    }

  # aws_vpc_endpoint.interface["ecr_api"] will be created
  + resource "aws_vpc_endpoint" "interface" {
      + arn                   = (known after apply)
      + cidr_blocks           = (known after apply)
      + dns_entry             = (known after apply)
      + id                    = (known after apply)
      + ip_address_type       = (known after apply)
      + network_interface_ids = (known after apply)
      + owner_id              = (known after apply)
      + policy                = (known after apply)
      + prefix_list_id        = (known after apply)
      + private_dns_enabled   = true
      + requester_managed     = (known after apply)
      + route_table_ids       = (known after apply)
      + security_group_ids    = [
          + "sg-0b73364c50284a880",
        ]
      + service_name          = "com.amazonaws.ap-northeast-1.ecr.api"
      + state                 = (known after apply)
      + subnet_ids            = [
          + "subnet-05c836901eb4bd41b",
          + "subnet-0b7bb2ff6472f2b69",
        ]
      + tags                  = {
          + "Name" = "ecr_api"
        }
      + tags_all              = {
          + "Managed" = "Terraform"
          + "Name"    = "ecr_api"
        }
      + vpc_endpoint_type     = "Interface"
      + vpc_id                = "vpc-04a61e17cecb81c94"

      + dns_options (known after apply)

      + subnet_configuration (known after apply)
    }

  # aws_vpc_endpoint.interface["ecr_dkr"] will be created
  + resource "aws_vpc_endpoint" "interface" {
      + arn                   = (known after apply)
      + cidr_blocks           = (known after apply)
      + dns_entry             = (known after apply)
      + id                    = (known after apply)
      + ip_address_type       = (known after apply)
      + network_interface_ids = (known after apply)
      + owner_id              = (known after apply)
      + policy                = (known after apply)
      + prefix_list_id        = (known after apply)
      + private_dns_enabled   = true
      + requester_managed     = (known after apply)
      + route_table_ids       = (known after apply)
      + security_group_ids    = [
          + "sg-0b73364c50284a880",
        ]
      + service_name          = "com.amazonaws.ap-northeast-1.ecr.dkr"
      + state                 = (known after apply)
      + subnet_ids            = [
          + "subnet-05c836901eb4bd41b",
          + "subnet-0b7bb2ff6472f2b69",
        ]
      + tags                  = {
          + "Name" = "ecr_dkr"
        }
      + tags_all              = {
          + "Managed" = "Terraform"
          + "Name"    = "ecr_dkr"
        }
      + vpc_endpoint_type     = "Interface"
      + vpc_id                = "vpc-04a61e17cecb81c94"

      + dns_options (known after apply)

      + subnet_configuration (known after apply)
    }

  # aws_vpc_endpoint.interface_logs will be created
  + resource "aws_vpc_endpoint" "interface_logs" {
      + arn                   = (known after apply)
      + cidr_blocks           = (known after apply)
      + dns_entry             = (known after apply)
      + id                    = (known after apply)
      + ip_address_type       = (known after apply)
      + network_interface_ids = (known after apply)
      + owner_id              = (known after apply)
      + policy                = (known after apply)
      + prefix_list_id        = (known after apply)
      + private_dns_enabled   = true
      + requester_managed     = (known after apply)
      + route_table_ids       = (known after apply)
      + security_group_ids    = [
          + "sg-0b73364c50284a880",
        ]
      + service_name          = "com.amazonaws.ap-northeast-1.logs"
      + state                 = (known after apply)
      + subnet_ids            = [
          + "subnet-05c836901eb4bd41b",
          + "subnet-0b7bb2ff6472f2b69",
        ]
      + tags                  = {
          + "Name" = "cw-logs"
        }
      + tags_all              = {
          + "Managed" = "Terraform"
          + "Name"    = "cw-logs"
        }
      + vpc_endpoint_type     = "Interface"
      + vpc_id                = "vpc-04a61e17cecb81c94"

      + dns_options (known after apply)

      + subnet_configuration (known after apply)
    }

  # aws_vpc_endpoint.s3_gateway will be created
  + resource "aws_vpc_endpoint" "s3_gateway" {
      + arn                   = (known after apply)
      + cidr_blocks           = (known after apply)
      + dns_entry             = (known after apply)
      + id                    = (known after apply)
      + ip_address_type       = (known after apply)
      + network_interface_ids = (known after apply)
      + owner_id              = (known after apply)
      + policy                = (known after apply)
      + prefix_list_id        = (known after apply)
      + private_dns_enabled   = (known after apply)
      + requester_managed     = (known after apply)
      + route_table_ids       = [
          + "rtb-00bfb2a9a2de18751",
        ]
      + security_group_ids    = (known after apply)
      + service_name          = "com.amazonaws.ap-northeast-1.s3"
      + state                 = (known after apply)
      + subnet_ids            = (known after apply)
      + tags                  = {
          + "Name" = "s3_gateway"
        }
      + tags_all              = {
          + "Managed" = "Terraform"
          + "Name"    = "s3_gateway"
        }
      + vpc_endpoint_type     = "Gateway"
      + vpc_id                = "vpc-04a61e17cecb81c94"

      + dns_options (known after apply)

      + subnet_configuration (known after apply)
    }

  # aws_vpc_security_group_ingress_rule.frontend will be created
  + resource "aws_vpc_security_group_ingress_rule" "frontend" {
      + arn                          = (known after apply)
      + id                           = (known after apply)
      + ip_protocol                  = "-1"
      + referenced_security_group_id = "sg-0e4473224aa390b41"
      + security_group_id            = "sg-052cb2af249584e81"
      + security_group_rule_id       = (known after apply)
      + tags_all                     = {
          + "Managed" = "Terraform"
        }
    }

  # aws_vpc_security_group_ingress_rule.ingress will be created
  + resource "aws_vpc_security_group_ingress_rule" "ingress" {
      + arn                    = (known after apply)
      + cidr_ipv4              = "0.0.0.0/0"
      + from_port              = 80
      + id                     = (known after apply)
      + ip_protocol            = "tcp"
      + security_group_id      = "sg-0e4473224aa390b41"
      + security_group_rule_id = (known after apply)
      + tags_all               = {
          + "Managed" = "Terraform"
        }
      + to_port                = 80
    }

Plan: 16 to add, 0 to change, 4 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","JobName":"plan","PRNumber":38,"Program":"tfcmt","SHA1":"362809a68abeb40c98d83f25f9ae11aa61f99727","Target":"ecs_practice/terraform","Vars":{},"WorkflowName":"terraform-plan"} -->